wisteria-1c/Конфигурация/DataProcessors/СопоставлениеНоменклатурыЕГАИСУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СопоставлениеНоменклатурыЕГАИСУНФ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/СоответствиеНоменклатурыЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьАлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусУказанияСерий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/КлассификаторОрганизацийЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторОрганизацийЕГАИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОрганизацииТС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтраны</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сопоставлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаходитсяВСельскойМестности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматыОбменаЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Внутренние значения полей адреса (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУНП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/КлассификаторАлкогольнойПродукцииЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторАлкогольнойПродукцииЕГАИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Импортер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНоменклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьХарактеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСопоставлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьУпаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/DataProcessors/СопоставлениеНоменклатурыЕГАИСУНФ/Forms/ФормаСопоставленияНоменклатуры/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);
	
	ТаблицаАлкогольнойПродукции = СтруктураДанных.АлкогольнаяПродукция;
	ТаблицаНоменклатуры         = СтруктураДанных.Номенклатура;
	
	ТаблицаНеСопоставленнойАлкогольнойПродукции.Загрузить(ТаблицаАлкогольнойПродукции);
	ТаблицаНеСопоставленнойНоменклатуры.Загрузить(ТаблицаНоменклатуры);
	
	АдаптацияФормыТакси();
	АдаптацияФормыМК();
	
	Если ЭтоМобильныйКлиент Тогда
		Элементы.АлкогольнаяПродукция.СписокВыбора.ЗагрузитьЗначения(
			ТаблицаАлкогольнойПродукции.ВыгрузитьКолонку("АлкогольнаяПродукция"));
		Элементы.Номенклатура.СписокВыбора.ЗагрузитьЗначения(
			ТаблицаНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
		АлкогольнаяПродукция = ТаблицаНеСопоставленнойАлкогольнойПродукции[0].АлкогольнаяПродукция;
		Номенклатура = ТаблицаНеСопоставленнойНоменклатуры[0].Номенклатура;
		Характеристика = ТаблицаНеСопоставленнойНоменклатуры[0].Характеристика;
		ОбновитьСтатусИспользованияХарактеристики = Истина;
		УстановитьВидимостьЭлементовФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ИспользуютсяХарактеристики Тогда
		ПроверяемыеРеквизиты.Добавить("Характеристика");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	Если ЭтоМобильныйКлиент Тогда
		ПараметрыОтбора = Новый Структура("Номенклатура", Номенклатура);
		НайденныеСтроки = ТаблицаНеСопоставленнойНоменклатуры.НайтиСтроки(ПараметрыОтбора);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Характеристика = Характеристика;
		КонецЦикла;
	Иначе
		Элементы.ТаблицаНеСопоставленнойНоменклатуры.ТекущиеДанные.Характеристика = Характеристика;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНеСопоставленнойАлкогольнойПродукцииПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ТаблицаНеСопоставленнойАлкогольнойПродукции.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если АлкогольнаяПродукция <> ТекущиеДанные.АлкогольнаяПродукция Тогда
		АлкогольнаяПродукция = ТекущиеДанные.АлкогольнаяПродукция;
		Если НЕ Номенклатура.Пустая() Тогда
			ПодключитьОбработчикОжидания("Подключаемый_УстановитьВидимостьЭлементовФормы",
				0.1, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНеСопоставленнойНоменклатурыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ТаблицаНеСопоставленнойНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Номенклатура <> ТекущиеДанные.Номенклатура
		ИЛИ Характеристика <> ТекущиеДанные.Характеристика Тогда
		Номенклатура   = ТекущиеДанные.Номенклатура;
		Характеристика = ТекущиеДанные.Характеристика;
		ОбновитьСтатусИспользованияХарактеристики = Истина;
		Если НЕ АлкогольнаяПродукция.Пустая() Тогда
			ПодключитьОбработчикОжидания("Подключаемый_УстановитьВидимостьЭлементовФормы",
				0.1, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АлкогольнаяПродукцияПриИзменении(Элемент)
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ПараметрыОтбора = Новый Структура("Номенклатура", Номенклатура);
	НайденныеСтроки = ТаблицаНеСопоставленнойНоменклатуры.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() Тогда
		Характеристика = НайденныеСтроки[0].Характеристика;
	КонецЕсли;
	ОбновитьСтатусИспользованияХарактеристики = Истина;
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьСоответствие(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьПредупреждения() Тогда
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ЗаписатьСоответствие_Завершение", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеПриЗавершении, НСтр("ru = 'Между связываемыми элементами есть расхождения. Продолжить?'"), РежимДиалогаВопрос.ОКОтмена,, КодВозвратаДиалога.Отмена);
	Иначе
		ЗаписатьСоответствие_Завершение(КодВозвратаДиалога.ОК, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСоответствие_Завершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьСоответствиеНаСервере();
	
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("СопоставлениеВыполнено", Истина);
	ПараметрыЗакрытия.Вставить("Номенклатура", Номенклатура);
	ПараметрыЗакрытия.Вставить("Характеристика", Характеристика);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСоответствиеНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АлкогольнаяПродукция", ТаблицаНеСопоставленнойАлкогольнойПродукции.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	МАКСИМУМ(СоответствиеНоменклатурыЕГАИС.Порядок) КАК Порядок
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|ГДЕ
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция В(&АлкогольнаяПродукция)
	|
	|СГРУППИРОВАТЬ ПО
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого СтрокаАлкогольнаяПродукция Из ТаблицаНеСопоставленнойАлкогольнойПродукции Цикл
		
		Порядок = 0;

		СтруктураПоиска = Новый Структура("АлкогольнаяПродукция");
		СтруктураПоиска.АлкогольнаяПродукция = СтрокаАлкогольнаяПродукция.АлкогольнаяПродукция;
		
		Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
			Если ТипЗнч(Выборка.Порядок) = Тип("Число") Тогда
				Порядок = Выборка.Порядок;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого СтрокаНоменклатура Из ТаблицаНеСопоставленнойНоменклатуры Цикл 
			
			Запись = РегистрыСведений.СоответствиеНоменклатурыЕГАИС.СоздатьМенеджерЗаписи();
			Запись.АлкогольнаяПродукция = СтрокаАлкогольнаяПродукция.АлкогольнаяПродукция;
			Запись.Номенклатура         = СтрокаНоменклатура.Номенклатура;
			Запись.Характеристика       = СтрокаНоменклатура.Характеристика;
			Запись.Порядок              = Порядок + 1;
			Запись.Записать();
			
			Порядок = Запись.Порядок;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ДополнитьРеквизитыНоменклатуры();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	ДанныеАлкогольнойПродукции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(АлкогольнаяПродукция,
		"Импортер, Объем, Крепость, ВидПродукции, Производитель");
	
	РеквизитыНоменклатуры = Новый Структура;
	РеквизитыНоменклатуры.Вставить("ОбъемДАЛ", "ОбъемДАЛ");
	РеквизитыНоменклатуры.Вставить("Крепость", "Крепость");
	РеквизитыНоменклатуры.Вставить("ВидАлкогольнойПродукции", "ВидАлкогольнойПродукции");
	РеквизитыНоменклатуры.Вставить("Производитель", "Производитель");
	РеквизитыНоменклатуры.Вставить("ПроизводительИмпортерАлкогольнойПродукции",
		"ПроизводительИмпортерАлкогольнойПродукции");
	Если ОбновитьСтатусИспользованияХарактеристики Тогда
		РеквизитыНоменклатуры.Вставить("ИспользоватьХарактеристики",
			"ИспользоватьХарактеристики");
	КонецЕсли;
	ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, РеквизитыНоменклатуры);
	
	Если ОбновитьСтатусИспользованияХарактеристики Тогда
		ИспользуютсяХарактеристики = ДанныеНоменклатуры.ИспользоватьХарактеристики;
		ОбновитьСтатусИспользованияХарактеристики = Ложь;
	КонецЕсли;
	
	Элементы.Характеристика.Доступность = ИспользуютсяХарактеристики;
	
	Если ДанныеАлкогольнойПродукции.Импортер.Пустая() Тогда
		Элементы.АлкогольнаяПродукцияИмпортер.Видимость = Ложь;
		Элементы.НоменклатураПроизводитель.Видимость = Ложь;
		Элементы.НоменклатураПроизводительИмпортерАлкогольнойПродукции.Заголовок = НСтр("ru = 'Производитель'");
	Иначе
		Элементы.АлкогольнаяПродукцияИмпортер.Видимость = Истина;
		Элементы.НоменклатураПроизводитель.Видимость = Истина;
		Элементы.НоменклатураПроизводительИмпортерАлкогольнойПродукции.Заголовок = НСтр("ru = 'Импортер'");
	КонецЕсли;
	Элементы.ПредупреждениеОбъем.Видимость         = ДанныеНоменклатуры.ОбъемДАЛ <> 0 И ДанныеНоменклатуры.ОбъемДАЛ <> ДанныеАлкогольнойПродукции.Объем / 10;
	Элементы.ПредупреждениеКрепость.Видимость      = ДанныеНоменклатуры.Крепость <> 0 И ДанныеНоменклатуры.Крепость <> ДанныеАлкогольнойПродукции.Крепость;
	Элементы.ПредупреждениеВидПродукции.Видимость  = ДанныеНоменклатуры.ВидАлкогольнойПродукции <> ДанныеАлкогольнойПродукции.ВидПродукции;
	Элементы.ПредупреждениеПроизводитель.Видимость = Элементы.НоменклатураПроизводитель.Видимость
	                                                 И НЕ ДанныеНоменклатуры.Производитель.Пустая()
	                                                 И НЕ ДанныеАлкогольнойПродукции.Производитель.Пустая()
	                                                 И ПолучитьКонтрагентаПоСоответствию(ДанныеАлкогольнойПродукции.Производитель) <> ДанныеНоменклатуры.Производитель;
	Элементы.ПредупреждениеИмпортер.Видимость      = НЕ ДанныеНоменклатуры.ПроизводительИмпортерАлкогольнойПродукции.Пустая()
	                                                 И (НЕ ДанныеАлкогольнойПродукции.Импортер.Пустая()
	                                                    И ПолучитьКонтрагентаПоСоответствию(ДанныеАлкогольнойПродукции.Импортер) <> ДанныеНоменклатуры.ПроизводительИмпортерАлкогольнойПродукции
	                                                    ИЛИ НЕ ДанныеАлкогольнойПродукции.Производитель.Пустая()
	                                                        И ДанныеАлкогольнойПродукции.Импортер.Пустая()
	                                                        И ПолучитьКонтрагентаПоСоответствию(ДанныеАлкогольнойПродукции.Производитель) <> ДанныеНоменклатуры.ПроизводительИмпортерАлкогольнойПродукции);
	
	Если ЭтоМобильныйКлиент Тогда
		ОтобразитьПодсказкиПредупреждений();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьПредупреждения()
	
	Возврат Элементы.ПредупреждениеОбъем.Видимость
		ИЛИ Элементы.ПредупреждениеКрепость.Видимость
		ИЛИ Элементы.ПредупреждениеВидПродукции.Видимость
		ИЛИ Элементы.ПредупреждениеПроизводитель.Видимость
		ИЛИ Элементы.ПредупреждениеИмпортер.Видимость;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКонтрагентаПоСоответствию(ОрганизацияЕГАИС)
	
	Если ОрганизацияЕГАИС.Пустая() Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторОрганизацийЕГАИС.Контрагент КАК Контрагент
	|ИЗ
	|	Справочник.КлассификаторОрганизацийЕГАИС КАК КлассификаторОрганизацийЕГАИС
	|ГДЕ
	|	КлассификаторОрганизацийЕГАИС.Сопоставлено
	|	И КлассификаторОрганизацийЕГАИС.Ссылка = &ОрганизацияЕГАИС";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Контрагент;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ДополнитьРеквизитыНоменклатуры()
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.КлассификаторАлкогольнойПродукцииЕГАИС");
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.Номенклатура");
		
		БлокировкаДанных.Заблокировать();
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КлассификаторАлкогольнойПродукцииЕГАИС.Ссылка,
		|	КлассификаторАлкогольнойПродукцииЕГАИС.Объем,
		|	КлассификаторАлкогольнойПродукцииЕГАИС.Крепость,
		|	КлассификаторАлкогольнойПродукцииЕГАИС.ВидПродукции,
		|	КлассификаторАлкогольнойПродукцииЕГАИС.Производитель,
		|	КлассификаторАлкогольнойПродукцииЕГАИС.Импортер
		|ИЗ
		|	Справочник.КлассификаторАлкогольнойПродукцииЕГАИС КАК КлассификаторАлкогольнойПродукцииЕГАИС
		|ГДЕ
		|	КлассификаторАлкогольнойПродукцииЕГАИС.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", АлкогольнаяПродукция);
		
		Результат = Запрос.Выполнить();
		ВыборкаАлкогольнаяПродукция = Результат.Выбрать();
		
		Если ВыборкаАлкогольнаяПродукция.Следующий() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка,
			|	Номенклатура.ОбъемДАЛ,
			|	Номенклатура.Крепость,
			|	Номенклатура.ВидАлкогольнойПродукции,
			|	Номенклатура.Производитель,
			|	Номенклатура.ПроизводительИмпортерАлкогольнойПродукции
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Номенклатура);
			
			Результат = Запрос.Выполнить();
			ВыборкаНоменклатура = Результат.Выбрать();
			
			Если ВыборкаНоменклатура.Следующий() Тогда
				
				НеобходимостьЗаписи = Ложь;
				НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
				
				Если НЕ ЗначениеЗаполнено(ВыборкаНоменклатура.ОбъемДАЛ) Тогда
					НоменклатураОбъект.ОбъемДАЛ = ВыборкаАлкогольнаяПродукция.Объем / 10;
					НеобходимостьЗаписи = Истина;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ВыборкаНоменклатура.Крепость) Тогда
					НоменклатураОбъект.Крепость = ВыборкаАлкогольнаяПродукция.Крепость;
					НеобходимостьЗаписи = Истина;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ВыборкаНоменклатура.ВидАлкогольнойПродукции) Тогда
					НоменклатураОбъект.ВидАлкогольнойПродукции = ВыборкаАлкогольнаяПродукция.ВидПродукции;
					НеобходимостьЗаписи = Истина;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ВыборкаНоменклатура.Производитель) Тогда
					НоменклатураОбъект.Производитель = ПолучитьКонтрагентаПоСоответствию(ВыборкаАлкогольнаяПродукция.Производитель);
					НеобходимостьЗаписи = Истина;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ВыборкаНоменклатура.ПроизводительИмпортерАлкогольнойПродукции) Тогда
					НоменклатураОбъект.ПроизводительИмпортерАлкогольнойПродукции = ПолучитьКонтрагентаПоСоответствию(ВыборкаАлкогольнаяПродукция.Импортер);
					НеобходимостьЗаписи = Истина;
				КонецЕсли;
				
				Если НеобходимостьЗаписи Тогда
					
					НоменклатураОбъект.Записать();
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыТакси()
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	Если ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыФормыПредупреждение = Новый Массив;
	ЭлементыФормыПредупреждение.Добавить("ПредупреждениеОбъем");
	ЭлементыФормыПредупреждение.Добавить("ПредупреждениеКрепость");
	ЭлементыФормыПредупреждение.Добавить("ПредупреждениеВидПродукции");
	ЭлементыФормыПредупреждение.Добавить("ПредупреждениеПроизводитель");
	ЭлементыФормыПредупреждение.Добавить("ПредупреждениеИмпортер");
	Для каждого ЭлементФормыПредупреждение Из ЭлементыФормыПредупреждение Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭлементФормыПредупреждение,
			"Высота", 1);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭлементФормыПредупреждение,
			"ВертикальноеПоложениеВГруппе", ВертикальноеПоложениеЭлемента.Низ);
	КонецЦикла;
	
	Если ОбщегоНазначения.ЭтоВебКлиент() И НЕ ЭтоМобильныйКлиент Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ТаблицаНеСопоставленнойАлкогольнойПродукции",
			"МаксимальнаяВысота", 3);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ТаблицаНеСопоставленнойНоменклатуры",
			"МаксимальнаяВысота", 3);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыМК()
	
	Если НЕ ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСвойстваВидимость = "Видимость";
	ИмяЭлементаФормыАлкогольнаяПродукция = "АлкогольнаяПродукция";
	ИмяЭлементаФормыНоменклатура = "Номенклатура";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		ИмяЭлементаФормыАлкогольнаяПродукция,
		ИмяСвойстваВидимость, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		ИмяЭлементаФормыАлкогольнаяПродукция,
		"РежимВыбораИзСписка", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяЭлементаФормыНоменклатура,
		ИмяСвойстваВидимость, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяЭлементаФормыНоменклатура,
		"РежимВыбораИзСписка", Истина);
	
	КоличествоАлкогольнойПродукции = ТаблицаНеСопоставленнойАлкогольнойПродукции.Количество();
	Если КоличествоАлкогольнойПродукции > 1 Тогда
		ЗаголовокКоличестваАлкогольнойПродукции = СтрШаблон(НСтр("ru = '(Выбрано %1)'"),
			КоличествоАлкогольнойПродукции);
	Иначе
		ЗаголовокКоличестваАлкогольнойПродукции = "";
	КонецЕсли;
	ЗаголовокАлкогольнойПродукции = СтрШаблон(НСтр("ru = 'Алкогольная продукция ЕГАИС %1'"),
		ЗаголовокКоличестваАлкогольнойПродукции);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаАлкогольнаяПродукция",
		"Заголовок", ЗаголовокАлкогольнойПродукции);
	
	КоличествоНоменклатуры = ТаблицаНеСопоставленнойНоменклатуры.Количество();
	Если КоличествоНоменклатуры > 1 Тогда
		ЗаголовокКоличестваНоменклатуры = СтрШаблон(НСтр("ru = '(Выбрано %1)'"),
			КоличествоНоменклатуры);
	Иначе
		ЗаголовокКоличестваНоменклатуры = "";
	КонецЕсли;
	ЗаголовокНоменклатуры = СтрШаблон(НСтр("ru = 'Номенклатура %1'"),
		ЗаголовокКоличестваНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНоменклатура",
		"Заголовок", ЗаголовокНоменклатуры);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияХарактеристика",
		ИмяСвойстваВидимость, Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ТаблицаНеСопоставленнойАлкогольнойПродукции",
		ИмяСвойстваВидимость, Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ТаблицаНеСопоставленнойНоменклатуры",
		ИмяСвойстваВидимость, Ложь);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаАлкогольнаяПродукция",
		"Объединенная", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНоменклатура",
		"Объединенная", Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьПодсказкиПредупреждений()
	
	ЭлементыФормыПредупреждение = Новый Соответствие;
	
	ЭлементыФормыПредупреждение.Вставить("ГруппаНоменклатураОбъем",
		Элементы.ПредупреждениеОбъем.Видимость);
	ЭлементыФормыПредупреждение.Вставить("ГруппаНоменклатураКрепость",
		Элементы.ПредупреждениеКрепость.Видимость);
	ЭлементыФормыПредупреждение.Вставить("ГруппаНоменклатураВидПродукции",
		Элементы.ПредупреждениеВидПродукции.Видимость);
	ЭлементыФормыПредупреждение.Вставить("ГруппаНоменклатураПроизводитель",
		Элементы.ПредупреждениеПроизводитель.Видимость);
	ЭлементыФормыПредупреждение.Вставить("ГруппаНоменклатураИмпортер",
		Элементы.ПредупреждениеИмпортер.Видимость);
	
	Для каждого ЭлементФормыПредупреждение Из ЭлементыФормыПредупреждение Цикл
		Если ЭлементФормыПредупреждение.Значение Тогда
			ВариантОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		Иначе
			ВариантОтображениеПодсказки = ОтображениеПодсказки.Нет;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			ЭлементФормыПредупреждение.Ключ,
			"ОтображениеПодсказки", ВариантОтображениеПодсказки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьВидимостьЭлементовФормы()
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

#КонецОбласти
